# PtOnArc

## Description
Determines if a point is on an arc.

```pascal
FUNCTION PtOnArc(
				pt        : VECTOR;
				cenPt     : VECTOR;
				radius    : REAL;
				startAng  : REAL;
				sweepAng  : REAL;
				tolerance : REAL): BOOLEAN;
```

```python
def vs.PtOnArc(pt, cenPt, radius, startAng, sweepAng, tolerance):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|VECTOR|   |
|cenPt|VECTOR|   |
|radius|REAL|   |
|startAng|REAL|   |
|sweepAng|REAL|   |
|tolerance|REAL|   |

## Version
Availability: from Vectorworks 2014

## Category
* Graphic Calculation